app/controllers/home_controller.rb

  def profile

    @user = User.all
    @articles = Article.live.public.order("updated_at DESC").limit(8)
    @featured_articles = Article.live.public.featured.order("updated_at DESC").limit(2)
    @blog_category = Category.blog
    ids = Category.blog(:select => :id).collect(&:id)
    @blog_articles = Article.live.public.where(:category_id => ids).limit(5)
---
SELECT "users".* FROM "users"
SELECT "articles".* FROM "articles" WHERE (deleted_by is NULL) AND (is_public = 't') ORDER BY updated_at DESC LIMIT 8
SELECT "articles".* FROM "articles" WHERE (deleted_by is NULL) AND (is_public = 't') AND (is_featured = 't') ORDER BY updated_at DESC LIMIT 2
SELECT "categories".* FROM "categories" WHERE (is_blog = 't')
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" IN (NULL) AND (deleted_by is NULL) AND (is_public = 't') LIMIT 5